{
    "url": "https://slurm.schedmd.com/configless_slurm.html",
    "sections": [
        {
            "title": "\n\nSlurm Workload Manager\n\n",
            "content": "\n\nSchedMD\n\n"
        },
        {
            "title": "\"Configless\" Slurm",
            "content": "\"Configless\" Slurm is a feature that allows the compute nodes —\nspecifically the slurmd process — and user commands running on login\nnodes to pull configuration information directly from the slurmctld instead of\nfrom a pre-distributed local file. Your cluster does require a central set of\nconfiguration files on the Slurm controllers — \"configless\" in Slurm's\nparlance means that the compute nodes, login nodes, and other cluster hosts\ndo not need to be deployed with local copies of these files.The slurmd on startup will reach out to a slurmctld that you specify and the\nconfig files will be pulled to the node. This slurmctld can be identified by\neither an explicit option, or — preferably — through DNS SRV\nrecords defined within the cluster itself.If you have a login node you will be running client commands\nfrom, those client commands will have to use the DNS record to get the\nconfiguration information from the controller when they run.\nIf you expect to have a lot of traffic from a login node, this\ncan generate a lot of requests for the configuration files. In cases like\nthis, you may want to consider running slurmd on the machine so it can\nmanage the configuration files, but not allowing it to run jobs.Installation\n\nThere are no extra steps required to install this feature. It is built in\nby default starting with Slurm 20.02.SetupThe slurmctld must first be configured to run in the configless mode.\nThis is handled by setting SlurmctldParameters=enable_configless in\nslurm.conf and restarting slurmctld.Once enabled, you must configure the slurmd to get its configs from the\nslurmctld. This can be accomplished either by launching slurmd with the\n--conf-server option, or by setting a DNS SRV record and ensuring there\nis no local configuration file on the compute node.The --conf-server options takes precedence over the DNS record.The command line option takes \"$host[:$port]\", so an example would look like:\n\nslurmd --conf-server slurmctl-primary:6817\n\nSpecifying the port is optional and will default to 6817 if it is not present.\nMultiple slurmctlds can be specified as a comma-separated list, in priority\norder (highest to lowest).\n\nslurmd --conf-server slurmctl-primary:6817,slurmctl-secondary\nThe same information can be provided in a DNS SRV record. For example:\n_slurmctld._tcp 3600 IN SRV 10 0 6817 slurmctl-backup\n_slurmctld._tcp 3600 IN SRV 0 0 6817 slurmctl-primary\n\nWill provide the required information to the slurmd on startup. As shown above,\nmultiple SRV records can be specified if you have deployed Slurm in an HA\nsetup. The DNS SRV entry with the lowest priority should be your primary\nslurmctld, with higher priority values for backup slurmctlds.\nInitial Testing\n\nWith the slurmctld configured and slurmd started, you can check in a couple\nplaces to make sure the configs are present on the node. Config files will be\nin SlurmdSpoolDir under the /conf-cache/, and a symlink to this\nlocation will be created automatically in /run/slurm/conf. You can\nconfirm that reloading is working by adding a comment to your slurm.conf on the\nslurmctld node and running\nscontrol reconfig and checking that the config\nwas updated.Limitations\n\nUsing \"%n\" in \"SlurmdSpoolDir\" or \"SlurmdPidFile\" will not be properly\nsubstituted for the NodeName unless slurmd is also launched with the \"-N\"\noption.If you are using systemd to launch slurmd, you must ensure that\n\"ConditionPathExists=*\" is not present in the unit file or the slurmd will not\nstart. (The example slurmd.service file shipped in Slurm 20.02 and above does\nnot include this entry.)If any of the supported config files \"Include\" additional config files,\nthe Included configs will ONLY be shipped if their \"Include\" filename\nreference has no path separators and the file is located adjacent to slurm.conf.\nAny additional config files will need to be shared a different way or added to\nthe parent config.\nIf Prolog and Epilog scripts are specified in slurm.conf,\nthe scripts will ONLY be shipped if the filenames referenced have no path\nseparators and the file is located adjacent to slurm.conf.\nNotesThe order of precedence for determining what configuration source to use\nis as follows:\nThe slurmd --conf-server $host[:$port] option\nThe -f $config_file option\nThe SLURM_CONF environment variable (if set)\nA local slurm config file:\n  \nThe default slurm config file (likely /etc/slurm.conf)\nFor user commands, a cached slurm config file\n        (run/slurm/conf/slurm.conf)\n\n\nThe SLURM_CONF_SERVER environment variable (if set)\nAny DNS SRV records (from lowest priority value to highest)\n\nThe TTL (Time To Live) of the SRV record does not affect the validity\n    of the obtained configuration. The nodes will have to be notified of any\n    changes to the configuration file through an\n    scontrol reconfig or a slurmd restart.\n\nSupported configuration files are:\nslurm.conf\nacct_gather.conf\ncgroup.conf\ncli_filter.lua\ngres.conf\nhelpers.conf\njob_container.conf\nmpi.conf\noci.conf\nplugstack.conf\nscrun.lua\ntopology.conf\nLast modified 25 September 2024"
        },
        {
            "title": "Navigation",
            "content": "\nSlurm Workload Manager\nVersion 24.05\n\n\nAbout\n\nOverview\nRelease Notes\n\n\n\nUsing\n\nDocumentation\nFAQ\nPublications\n\n\n\nInstalling\n\nDownload\nRelated Software\nInstallation Guide\n\n\n\nGetting Help\n\nMailing Lists\nSupport and Training\nTroubleshooting\n\n\n"
        }
    ]
}