{
    "url": "https://slurm.schedmd.com/core_spec.html",
    "sections": [
        {
            "title": "\n\nSlurm Workload Manager\n\n",
            "content": "\n\nSchedMD\n\n"
        },
        {
            "title": "Core Specialization",
            "content": "Core specialization is a feature designed to isolate system overhead\n(system interrupts, etc.) to designated cores on a compute node.\nThis can reduce context switching in applications to improve completion time.\nThe job processes will not be able to directly use the specialized cores.Command OptionsAll job allocation commands (salloc, sbatch and srun)\naccept the -S or --core-spec option with a core count value\nargument (e.g. \"-S 1\" or \"--core-spec=2\").\nThe count identifies the number of cores to be reserved for system overhead on\neach allocated compute node. Note that the --core-spec option will be\nignored if AllowSpecResourcesUsage is not enabled in your slurm.conf.\nEach job's core specialization count can be viewed using the scontrol,\nsview or squeue command.\nSpecification of a core specialization count for a job step is ignored\n(i.e. for the srun command within a job allocation created using the\nsalloc or sbatch command).\nUse the squeue command with the \"%X\" format option to see the count\n(it is not reported in the default output format).\nThe scontrol and sview commands can also be used to modify\nthe count for pending jobs.Explicitly setting a job's specialized core value implicitly sets its\n--exclusive option, reserving entire nodes for the job.\nThe job will be charged for all non-specialized CPUs on the node and the job's\nNumCPUs value reported by the scontrol, sview and squeue\ncommands will reflect all non-specialized CPUS on all allocated nodes as will\nthe job's accounting.Note that, due to the implicit --exclusive, if the requested specialized\ncore/thread count is lower than the number of cores in the CoreSpecCount or\nin the CpuSpecList of the allocated node, then the step will have access to\nall of the non-specialized cores as well as the specialized cores freed for\nthis job.For example, suppose a node has AllowSpecResourcesUsage=yes and\nCoreSpecCount=2 configured in the slurm.conf for a node\nwith a total of 16 Cores. If a job specified --core-spec=1, the implicit\n--exclusive would lead to an exclusive allocation of the node, leaving\n15 cores for use by the job, and keeping 1 core for system use.In sacct, the step's allocated CPUs\nwill include the specialized cores or threads that it has access to. However,\nthe job's allocated CPU count never includes specialized cores or threads to\nensure that utilization reports are accurate.Here is an example configuration, setting cores 0 and 1 as\nspecialized:\nAllowSpecResourcesUsage=yes\nNodename=n0 Port=10100 CoresPerSocket=16 ThreadsPerCore=1 CpuSpecList=0-1\nSubmit a job requesting a core spec count of 1 (freeing up core\nnumber 1 for job use).\n$ salloc --core-spec=1\nsalloc: Granted job allocation 4152\n$ srun bash -c 'cat /proc/self/status |grep Cpus_'\nCpus_allowed:        fffe\nCpus_allowed_list:   1-15\nNotice the job CPU count vs the step CPU count.\n$ sacct -j 4152 -ojobid%20,alloccpus\n               JobID  AllocCPUS\n-------------------- ----------\n                4152         14\n    4152.interactive         15\n              4152.0         15\nCore SelectionThe specific resources to be used for specialization may be identified using\nthe CPUSpecList configuration parameter associated with each node in\nthe slurm.conf file.\nIf CoreSpecCount is configured, but not CPUSpecList, the cores\nselected for specialization will follow the assignment algorithm\ndescribed below .\nThe first core selected will be the highest numbered core on the highest\nnumbered socket.\nSubsequent cores selected will be the highest numbered core on lower\nnumbered sockets.\nIf additional cores are required, they will come from the next highest numbered\ncores on each socket.\nBy way of example, consider a node with two sockets, each with four cores.\nThe specialized cores will be selected in the following order:\nsocket: 1 core: 3\nsocket: 0 core: 3\nsocket: 1 core: 2\nsocket: 0 core: 2\nsocket: 1 core: 1\nsocket: 0 core: 1\nsocket: 1 core: 0\nsocket: 0 core: 0\nSlurm can be configured to specialize the first, rather than the last cores\nby configuring SchedulerParameters=spec_cores_first. In that case,\nthe first core selected will be the lowest numbered core on the lowest\nnumbered socket.\nSubsequent cores selected will be the lowest numbered core on higher\nnumbered sockets.\nIf additional cores are required, they well come from the next lowest numbered\ncores on each socket.Note that core specialization reservation may impact the use of some\njob allocation request options, especially --cores-per-socket.System Configuration\n\nCore specialization requires SelectType=cons_tres and the\ntask/cgroup TaskPlugin.\nSpecialized resources should be configured in slurm.conf on the\nnode specification line using the CoreSpecCount or CPUSpecList\noptions to identify the CPUs to reserve.\nThe MemSpecLimit option can be used to reserve memory.\nThese resources will be reserved using Linux cgroups.\nUsers wanting a different number of specialized cores should use the\n--core-spec option as described above.A job's core specialization option will be silently cleared on other\nconfigurations.\nIn addition, each compute node's core count must be configured or the CPUs\ncount must be configured to the node's core count.\nIf the core count is not configured and the CPUs value is configured to the\ncount of hyperthreads, then hyperthreads rather than cores will be reserved for\nsystem use.If users are to be granted the right to control the number of specialized\ncores for their job, the configuration parameter AllowSpecResourcesUsage\nmust be set to a value of 1.Last modified 16 January 2024"
        },
        {
            "title": "Navigation",
            "content": "\nSlurm Workload Manager\nVersion 24.05\n\n\nAbout\n\nOverview\nRelease Notes\n\n\n\nUsing\n\nDocumentation\nFAQ\nPublications\n\n\n\nInstalling\n\nDownload\nRelated Software\nInstallation Guide\n\n\n\nGetting Help\n\nMailing Lists\nSupport and Training\nTroubleshooting\n\n\n"
        }
    ]
}