{
    "url": "https://slurm.schedmd.com/job_reason_codes.html",
    "sections": [
        {
            "title": "\n\nSlurm Workload Manager\n\n",
            "content": "\n\nSchedMD\n\n"
        },
        {
            "title": "Job Reason Codes",
            "content": "These reason codes can be used to identify why a pending job has not yet been\nstarted by the scheduler. There may be multiple reasons why a job cannot start,\nin which case only the reason that was encountered by the attempted scheduling\nmethod will be displayed. Refer to the \nScheduling Configuration Guide for more details.Common Reasons\n\n\nAssocGrp* — The job's association has reached an aggregate\nlimit.\nAssocMax* — A portion of the job request exceeds a maximum\nlimit (e.g., PerJob, PerNode) for the\nrequested association.\nBeginTime — The job's earliest \nstart time has not yet been reached.\nDependency — This job has a\ndependency on another job that has not\nbeen satisfied.\nMax*PerAccount — A portion of the job request exceeds the\nper-Account limit on the job's\nQOS.\nPriority — One of more higher\npriority jobs exist for the partition\nassociated with the job or for the advanced\nreservation.\nQOSGrp* — The job's QOS has reached an\naggregate limit.\nQOSMax* — A portion of the job request exceeds a\nmaximum limit (e.g., PerJob, PerNode) for\nthe requested QOS.\nResources — The resources requested by the job are not\navailable (e.g., already used by other jobs).\nAll Reasons\n\n\nAccountingPolicy — Fallback reason when others not matched.\n\nAccountNotAllowed — Job is in an account not allowed in a\npartition.\nAssocGrpBB — The job's association has reached its aggregate\nBurst Buffer limit.\nAssocGrpBBMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Burst Buffers by past,\npresent and future jobs.\nAssocGrpBBRunMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Burst Buffers by\ncurrently running jobs.\nAssocGrpBilling — The job's association has reached its\naggregate Billing limit.\nAssocGrpBillingMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for the Billing value of\na resource by past, present and future jobs.\nAssocGrpBillingRunMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for the Billing value of a\nresource by currently running jobs.\nAssocGrpCpuLimit — The job's association has reached its\naggregate CPU limit.\nAssocGrpCPUMinutesLimit — The job's association has reached\nthe maximum number of minutes allowed in aggregate for CPUs by past, present\nand future jobs.\nAssocGrpCPURunMinutesLimit — The job's association has reached\nthe maximum number of minutes allowed in aggregate for CPUs by currently\nrunning jobs.\nAssocGrpEnergy — The job's association has reached its\naggregate Energy limit.\nAssocGrpEnergyMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Energy by past, present\nand future jobs.\nAssocGrpEnergyRunMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for Energy by currently\nrunning jobs.\nAssocGrpGRES — The job's association has reached its aggregate\nGRES limit.\nAssocGrpGRESMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for a GRES by past, present\nand future jobs.\nAssocGrpGRESRunMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for a GRES by currently\nrunning jobs.\nAssocGrpJobsLimit — The job's association has reached the\nmaximum number of allowed jobs in aggregate.\nAssocGrpLicense — The job's association has reached its\naggregate license limit.\nAssocGrpLicenseMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Licenses by past, present\nand future jobs.\nAssocGrpLicenseRunMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for Licenses by currently\nrunning jobs.\nAssocGrpMemLimit — The job's association has reached its\naggregate Memory limit.\nAssocGrpMemMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Memory by past, present\nand future jobs.\nAssocGrpMemRunMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Memory by currently\nrunning jobs.\nAssocGrpNodeLimit — The job's association has reached its\naggregate Node limit.\nAssocGrpNodeMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Nodes by past, present and\nfuture jobs.\nAssocGrpNodeRunMinutes — The job's association has reached the\nmaximum number of minutes allowed in aggregate for Nodes by currently running\njobs.\nAssocGrpSubmitJobsLimit — The job's association has reached the\nmaximum number of jobs that can be running or pending in aggregate at a given\ntime.\nAssocGrpUnknown — The job's association has reached its\naggregate limit for an unknown generic resource.\nAssocGrpUnknownMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for an unknown generic\nresource by past, present and future jobs.\nAssocGrpUnknownRunMinutes — The job's association has reached\nthe maximum number of minutes allowed in aggregate for an unknown generic\nresource by currently running jobs.\nAssocGrpWallLimit — The job's association has reached its\naggregate limit for the amount of walltime requested by running jobs.\nAssocMaxBBMinutesPerJob — The Burst Buffer request exceeds\nthe maximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxBBPerJob — The Burst Buffer request exceeds the\nmaximum each job is allowed to use for the requested association.\nAssocMaxBBPerNode — The Burst Buffer request exceeds the\nmaximum number each node in a job allocation is allowed to use for the\nrequested association.\nAssocMaxBillingMinutesPerJob — The request exceeds the\nmaximum number of minutes each job is allowed to use, with Billing taken into\naccount, for the requested association.\nAssocMaxBillingPerJob — The resource request exceeds the\nmaximum Billing limit each job is allowed to use for the requested\nassociation.\nAssocMaxBillingPerNode — The request exceeds the maximum\nBilling limit each node in a job allocation is allowed to use for the\nrequested association.\nAssocMaxCpuMinutesPerJobLimit — The CPU request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxCpuPerJobLimit — The CPU request exceeds the maximum\neach job is allowed to use for the requested association.\nAssocMaxCpuPerNode — The request exceeds the maximum number\nof CPUs each node in a job allocation is allowed to use for the requested\nassociation.\nAssocMaxEnergyMinutesPerJob — The Energy request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxEnergyPerJob — The Energy request exceeds the maximum\neach job is allowed to use for the requested association.\nAssocMaxEnergyPerNode — The request exceeds the maximum\namount of Energy each node in a job allocation is allowed to use for the\nrequested association.\nAssocMaxGRESMinutesPerJob — The GRES request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxGRESPerJob — The GRES request exceeds the maximum\neach job is allowed to use for the requested association.\nAssocMaxGRESPerNode — The request exceeds the maximum number\nof a GRES each node in a job allocation is allowed to use for the requested\nassociation.\nAssocMaxJobsLimit — The limit on the number of jobs each\nuser is allowed to run at a given time has been met for the requested\nassociation.\nAssocMaxLicenseMinutesPerJob — The License request exceeds\nthe maximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxLicensePerJob — The License request exceeds the\nmaximum each job is allowed to use for the requested association.\nAssocMaxMemMinutesPerJob — The Memory request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nassociation.\nAssocMaxMemPerJob — The Memory request exceeds the maximum\neach job is allowed to use for the requested association.\nAssocMaxMemPerNode — The request exceeds the maximum amount\nof Memory each node in a job allocation is allowed to use for the requested\nassociation.\nAssocMaxNodeMinutesPerJob — The number of nodes requested\nexceeds the maximum number of minutes each job is allowed to use for the\nrequested association.\nAssocMaxNodePerJobLimit — The number of nodes requested\nexceeds the maximum each job is allowed to use for the requested\nassociation.\nAssocMaxSubmitJobLimit — The limit on the number of jobs each\nuser is allowed to have running or pending at a given time has been met for\nthe requested association.\nAssocMaxUnknownMinutesPerJob — The request of an unknown\ntrackable resource exceeds the maximum number of minutes each job is allowed\nto use for the requested association.\nAssocMaxUnknownPerJob — The request of an unknown trackable\nresource exceeds the maximum each job is allowed to use for the requested\nassociation.\nAssocMaxUnknownPerNode — The request exceeds the maximum\nnumber of an unknown trackable resource each node in a job allocation is\nallowed to use for the requested association.\nAssocMaxWallDurationPerJobLimit — The limit on the amount of\nwall time a job can request has been exceeded for the requested association.\n\nAssociationJobLimit — The job's association has reached\nits maximum job count.\nAssociationResourceLimit — The job's association has reached\nsome resource limit.\nAssociationTimeLimit — The job's association has reached its\ntime limit.\nBadConstraints — The job's constraints can not be satisfied.\n\nBeginTime — The job's earliest start time has not yet been\nreached.\nBurstBufferOperation — Burst Buffer operation for the job\nfailed.\nBurstBufferResources — There are insufficient resources\nin a Burst Buffer resource pool.\nBurstBufferStageIn — The Burst Buffer plugin is in the\nprocess of staging the environment for the job.\nCleaning — The job is being requeued and still cleaning up\nfrom its previous execution.\nDeadLine — This job has violated the configured Deadline.\nDependency — This job has a dependency on another job that\nhas not been satisfied.\nDependencyNeverSatisfied — This job has a dependency on\nanother job that will never be satisfied.\nFedJobLock — The job is waiting for the clusters in the\nfederation to sync up and issue a lock.\nFrontEndDown — No front end node is available to execute this\njob.\nInactiveLimit — The job reached the system InactiveLimit.\nInvalidAccount — The job's account is invalid.\nInvalidQOS — The job's QOS is invalid.\nJobArrayTaskLimit — The job array's limit on the number of\nsimultaneously running tasks has been reached.\nJobHeldAdmin — The job is held by a system administrator.\nJobHeldUser — The job is held by the user.\nJobHoldMaxRequeue — Job has been requeued enough times to\nreach the MAX_BATCH_REQUEUE limit.\nJobLaunchFailure — The job could not be launched. This may\nbe due to a file system problem, invalid program name, etc.\nLicenses — The job is waiting for a license.\nMaxBBPerAccount — The job's Burst Buffer request exceeds the\nper-Account limit on the job's QOS.\nMaxBillingPerAccount — The job's Billing request exceeds the\nper-Account limit on the job's QOS.\nMaxCpuPerAccount — The job's CPU request exceeds the\nper-Account limit on the job's QOS.\nMaxEnergyPerAccount — The job's Energy request exceeds the\nper-Account limit on the job's QOS.\nMaxGRESPerAccount — The job's GRES request exceeds the\nper-Account limit on the job's QOS.\nMaxJobsPerAccount — This job exceeds the per-Account limit\non the number of jobs for the job's QOS.\nMaxLicensePerAccount — The job's License request exceeds the\nper-Account limit on the job's QOS.\nMaxMemoryPerAccount — The job's Memory request exceeds the\nper-Account limit on the job's QOS.\nMaxMemPerLimit — The job violates the limit on the maximum\namount of Memory per-CPU or per-Node.\nMaxNodePerAccount — The number of nodes requested by the job\nexceeds the per-Account limit on the number of nodes for the job's QOS.\nMaxSubmitJobsPerAccount — This job exceeds the per-Account\nlimit on the number of jobs in a pending or running state for the job's QOS.\n\nMaxUnknownPerAccount — The jobs request of an unknown GRES\nexceeds the per-Account limit on the job's QOS.\nNodeDown — A node required by the job is down.\nNonZeroExitCode — The job terminated with a non-zero exit\ncode.\nNone — The job hasn't had a reason assigned to it yet.\nOutOfMemory — The job failed with an Out Of Memory error.\n\nPartitionConfig — Fallback reason when the job violates\nsome limit on the partition.\nPartitionDown — The partition required by this job is in\na DOWN state.\nPartitionInactive — The partition required by this job is\nin an Inactive state and not able to start jobs.\nPartitionNodeLimit — The number of nodes required by this\njob is outside of its partition's current limits. Can also indicate that\nrequired nodes are DOWN or DRAINED.\nPartitionTimeLimit — The job's time limit exceeds its\npartition's current time limit.\nPriority — One of more higher priority jobs exist for the\npartition associated with the job or for the advanced reservation.\nProlog — The job's Prolog program is still running.\n\nQOSGrpBB — The job's QOS has reached its aggregate\nBurst Buffer limit.\nQOSGrpBBMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Burst Buffers by past,\npresent and future jobs.\nQOSGrpBBRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Burst Buffers by\ncurrently running jobs.\nQOSGrpBilling — The job's QOS has reached its aggregate\nBilling limit.\nQOSGrpBillingMinutes — The job's QOS has reached\nthe maximum number of minutes allowed in aggregate for the Billing value of\na resource by past, present and future jobs.\nQOSGrpBillingRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for the Billing value of a\nresource by currently running jobs.\nQOSGrpCpuLimit — The job's QOS has reached its aggregate\nCPU limit.\nQOSGrpCPUMinutesLimit — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for CPUs by past, present\nand future jobs.\nQOSGrpCPURunMinutesLimit — The job's QOS has reached\nthe maximum number of minutes allowed in aggregate for CPUs by currently\nrunning jobs.\nQOSGrpEnergy — The job's QOS has reached its aggregate\nEnergy limit.\nQOSGrpEnergyMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Energy by past, present\nand future jobs.\nQOSGrpEnergyRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Energy by currently\nrunning jobs.\nQOSGrpGRES — The job's QOS has reached its aggregate GRES\nlimit.\nQOSGrpGRESMinutes — The job's QOS has reached the maximum\nnumber of minutes allowed in aggregate for a GRES by past, present and\nfuture jobs.\nQOSGrpGRESRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for a GRES by currently\nrunning jobs.\nQOSGrpJobsLimit — The job's QOS has reached the maximum\nnumber of allowed jobs in aggregate.\nQOSGrpLicense — The job's QOS has reached its aggregate\nlicense limit.\nQOSGrpLicenseMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Licenses by past, present\nand future jobs.\nQOSGrpLicenseRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Licenses by currently\nrunning jobs.\nQOSGrpMemLimit — The job's QOS has reached its aggregate\nMemory limit.\nQOSGrpMemoryMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Memory by past, present\nand future jobs.\nQOSGrpMemoryRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for Memory by currently\nrunning jobs.\nQOSGrpNodeLimit — The job's QOS has reached its\naggregate Node limit.\nQOSGrpNodeMinutes — The job's QOS has reached the maximum\nnumber of minutes allowed in aggregate for Nodes by past, present and\nfuture jobs.\nQOSGrpNodeRunMinutes — The job's QOS has reached the maximum\nnumber of minutes allowed in aggregate for Nodes by currently running jobs.\nQOSGrpSubmitJobsLimit — The job's QOS has reached the maximum\nnumber of jobs that can be running or pending in aggregate at a given time.\nQOSGrpUnknown — The job's QOS has reached its aggregate limit\nfor an unknown generic resource.\nQOSGrpUnknownMinutes — The job's QOS has reached the maximum\nnumber of minutes allowed in aggregate for an unknown generic resource by\npast, present and future jobs.\nQOSGrpUnknownRunMinutes — The job's QOS has reached the\nmaximum number of minutes allowed in aggregate for an unknown generic\nresource by currently running jobs.\nQOSGrpWallLimit — The job's QOS has reached its aggregate\nlimit for the amount of walltime requested by running jobs.\nQOSJobLimit — The job's QOS has reached its maximum job\ncount.\nQOSMaxBBMinutesPerJob — The Burst Buffer request exceeds\nthe maximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxBBPerJob — The Burst Buffer request exceeds the\nmaximum each job is allowed to use for the requested QOS.\nQOSMaxBBPerNode — The Burst Buffer request exceeds the\nmaximum number each node in a job allocation is allowed to use for the\nrequested QOS.\nQOSMaxBBPerUser — The Burst Buffer request exceeds the\nmaximum number each user is allowed to use for the requested QOS.\nQOSMaxBillingMinutesPerJob — The request exceeds the\nmaximum number of minutes each job is allowed to use, with Billing taken into\naccount, for the requested QOS.\nQOSMaxBillingPerJob — The resource request exceeds the\nmaximum Billing limit each job is allowed to use for the requested\nQOS.\nQOSMaxBillingPerNode — The request exceeds the maximum\nBilling limit each node in a job allocation is allowed to use for the\nrequested QOS.\nQOSMaxBillingPerUser — The request exceeds the maximum\nBilling limit each user is allowed to use for the requested QOS.\nQOSMaxCpuMinutesPerJobLimit — The CPU request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxCpuPerJobLimit — The CPU request exceeds the maximum\neach job is allowed to use for the requested QOS.\nQOSMaxCpuPerNode — The request exceeds the maximum number\nof CPUs each node in a job allocation is allowed to use for the requested\nQOS.\nQOSMaxCpuPerUserLimit — The CPU request exceeds the maximum\neach user is allowed to use for the requested QOS.\nQOSMaxEnergyMinutesPerJob — The Energy request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxEnergyPerJob — The Energy request exceeds the maximum\neach job is allowed to use for the requested QOS.\nQOSMaxEnergyPerNode — The request exceeds the maximum\namount of Energy each node in a job allocation is allowed to use for the\nrequested QOS.\nQOSMaxEnergyPerUser — The request exceeds the maximum\namount of Energy each user is allowed to use for the requested QOS.\nQOSMaxGRESMinutesPerJob — The GRES request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxGRESPerJob — The GRES request exceeds the maximum\neach job is allowed to use for the requested QOS.\nQOSMaxGRESPerNode — The request exceeds the maximum number\nof a GRES each node in a job allocation is allowed to use for the requested\nQOS.\nQOSMaxGRESPerUser — The request exceeds the maximum number\nof a GRES each user is allowed to use for the requested QOS.\nQOSMaxJobsPerUserLimit — The limit on the number of jobs a\nuser is allowed to run at a given time has been met for the requested\nQOS.\nQOSMaxLicenseMinutesPerJob — The License request exceeds\nthe maximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxLicensePerJob — The License request exceeds the\nmaximum each job is allowed to use for the requested QOS.\nQOSMaxLicensePerUser — The License request exceeds the\nmaximum each user is allowed to use for the requested QOS.\nQOSMaxMemoryMinutesPerJob — The Memory request exceeds the\nmaximum number of minutes each job is allowed to use for the requested\nQOS.\nQOSMaxMemoryPerJob — The Memory request exceeds the maximum\neach job is allowed to use for the requested QOS.\nQOSMaxMemoryPerNode — The request exceeds the maximum amount\nof Memory each node in a job allocation is allowed to use for the requested\nQOS.\nQOSMaxMemoryPerUser — The request exceeds the maximum amount\nof Memory each user is allowed to use for the requested QOS.\nQOSMaxNodeMinutesPerJob — The number of nodes requested\nexceeds the maximum number of minutes each job is allowed to use for the\nrequested QOS.\nQOSMaxNodePerJobLimit — The number of nodes requested\nexceeds the maximum each job is allowed to use for the requested\nQOS.\nQOSMaxNodePerUserLimit — The number of nodes requested\nexceeds the maximum each user is allowed to use for the requested\nQOS.\nQOSMaxSubmitJobPerUserLimit — The limit on the number of\njobs each user is allowed to have running or pending at a given time has\nbeen met for the requested QOS.\nQOSMaxUnknownMinutesPerJob — The request of an unknown\ntrackable resource exceeds the maximum number of minutes each job is allowed\nto use for the requested QOS.\nQOSMaxUnknownPerJob — The request of an unknown trackable\nresource exceeds the maximum each job is allowed to use for the requested\nQOS.\nQOSMaxUnknownPerNode — The request exceeds the maximum\nnumber of an unknown trackable resource each node in a job allocation is\nallowed to use for the requested QOS.\nQOSMaxUnknownPerUser — The request exceeds the maximum\nnumber of an unknown trackable resource each user is allowed to use for\nthe requested QOS.\nQOSMaxWallDurationPerJobLimit — The limit on the amount of\nwall time a job can request has been exceeded for the requested QOS.\nQOSMinBB — The Burst Buffer request does not meet the\nminimum each job is required to request for the requested QOS.\nQOSMinBilling — The resource request does not meet the\nminimum Billing limit each job is allowed to use for the requested\nQOS.\nQOSMinCpuNotSatisfied — The CPU request does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinEnergy — The Energy request does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinGRES — The GRES request does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinLicense — The License request does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinMemory — The Memory request does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinNode — The number of nodes requested does not meet the\nminimum each job is allowed to use for the requested QOS.\nQOSMinUnknown — The request of an unknown trackable resource\ndoes not meet the minimum each job is allowed to use for the requested QOS.\nQOSNotAllowed — The job requests a QOS is not allowed by\nthe requested association or partition.\nQOSResourceLimit — The job's QOS has reached some resource\nlimit.\nQOSTimeLimit — The job's QOS has reached its time limit.\nQOSUsageThreshold — Required QOS threshold has been\nbreached.\nReqNodeNotAvail — Some node specifically required by the job\nis not currently available. The node may currently be in use, reserved for\nanother job, in an advanced reservation, DOWN, DRAINED, or not responding.\nNodes which are DOWN, DRAINED, or not responding will be identified as part\nof the job's \"reason\" field as \"UnavailableNodes\". Such nodes will typically\nrequire the intervention of a system administrator to make available.\nReservation — The job is waiting its advanced reservation to\nbecome available.\nReservationDeleted — The job requested a reservation that is\nno longer on the system.\nResources — The resources requested by the job are not\navailable (e.g., already used by other jobs).\nSchedDefer — The job requests an immediate allocation but\nSchedulerParameters=defer is configured in the slurm.conf.\nSystemFailure — Failure of the Slurm system, a file system,\nthe network, etc.\nTimeLimit — The job exhausted its time limit.\nLast modified 08 October 2024\n"
        },
        {
            "title": "Navigation",
            "content": "\nSlurm Workload Manager\nVersion 24.05\n\n\nAbout\n\nOverview\nRelease Notes\n\n\n\nUsing\n\nDocumentation\nFAQ\nPublications\n\n\n\nInstalling\n\nDownload\nRelated Software\nInstallation Guide\n\n\n\nGetting Help\n\nMailing Lists\nSupport and Training\nTroubleshooting\n\n\n"
        }
    ]
}