{
    "url": "https://slurm.schedmd.com/resource_binding.html",
    "sections": [
        {
            "title": "\n\nSlurm Workload Manager\n\n",
            "content": "\n\nSchedMD\n\n"
        },
        {
            "title": "Resource Binding",
            "content": "\nOverview\nSrun --cpu-bind option\nNode CpuBind Configuration\nPartition CpuBind Configuration\nTaskPluginParam Configuration\nOverviewSlurm has a rich set of options to control the default\nbinding of tasks to resources.\nFor example, tasks can be bound to individual threads, cores, sockets, NUMA\nor boards.\nSee the slurm.conf and srun man pages for more information about how these\noptions work.\nThis document focuses on how default binding configuration can be configured.\nDefault binding can be configured on a per-node, per-partition or global\nbasis. The highest priority will be that specified using the srun\n--cpu-bind option.\nThe next highest priority binding will be the node-specific binding, if any\nnode in the job allocation has some \nCpuBind configuration parameter and all other nodes in the job\nallocation either have the same or no CpuBind configuration parameter.\nThe next highest priority binding will be the partition-specific\nCpuBind configuration\nparameter (if any).\nThe lowest priority binding will be that specified by the\nTaskPluginParam\nconfiguration parameter.Summary of the order of enforcement:\n\nSrun --cpu-bind option\nNode CpuBind configuration parameter (if all nodes match)\nPartition CpuBind configuration parameter\nTaskPluginParam configuration parameter\n\nSrun --cpu-bind optionThe srun --cpu-bind option will always\nbe used to control task binding. If the --cpu-bind option only includes\n\"verbose\" rather than identifying the entities to be bound to, then the verbose\noption will be used together with the default entity based upon Slurm\nconfiguration parameters as described below.Node CpuBind Configuration\n\nThe next possible source of the resource binding information is the node's\nconfigured CpuBind value, but only\nif every node has the same CpuBind value (or no configured CpuBind value).\nThe node's CpuBind value is configured in the slurm.conf file.\nIts value may be viewed or modified using the scontrol command.\nTo clear a node's CpuBind value use the command:\n\nscontrol update NodeName=node01 CpuBind=off\n\nIf a node_features plugin is configured, typically to support booting Intel\nKNL nodes into different NUMA and/or MCDRAM modes, the plugin can be configured\nto modify the node's CpuBind option based upon the NUMA mode.\nThis is accomplished by specifying the NumaCpuBind parameter in the knl.conf\nconfiguration file with pairs of NUMA modes and CpuBind options.\nAs soon as the node is booted into a new NUMA mode, the node's CpuBind option\nis automatically modified.\nFor example, a line like the following in the knl.conf file\n(NumaCpuBind=a2a=core;snc2=thread),\nwill set a node's CpuBind field to \"core\" when booted into \"a2a\" (all to all)\nNUMA mode and to \"thread\" when booted into \"snc2 NUMA mode.\nAny NUMA mode not specified in the NumaCpuBind configuration file will result\nin no change to the node's CpuBind field.Partition CpuBind Configuration\n\nThe next possible source of the resource binding information is the\npartition's configured CpuBind\nvalue. The partition's CpuBind value is configured in the slurm.conf file.\nIts value may be viewed or modified using the scontrol command, similar to how\na node's CpuBind value is changed:\n\nscontrol update PartitionName=debug CpuBind=cores\n\nTaskPluginParam Configuration\n\nThe last possible source of the resource binding information is the\nTaskPluginParam\nconfiguration parameter from the slurm.conf file.Last modified 10 July 2024"
        },
        {
            "title": "Navigation",
            "content": "\nSlurm Workload Manager\nVersion 24.05\n\n\nAbout\n\nOverview\nRelease Notes\n\n\n\nUsing\n\nDocumentation\nFAQ\nPublications\n\n\n\nInstalling\n\nDownload\nRelated Software\nInstallation Guide\n\n\n\nGetting Help\n\nMailing Lists\nSupport and Training\nTroubleshooting\n\n\n"
        }
    ]
}